app/controllers/admin/products_controller.rb

    def set_product
      @product = Product.find_by_permalink(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."permalink" = ? LIMIT 1  [["permalink", "waffle-cone-pine"]]