app/controllers/admin/products_controller.rb

    def create
      @product = Product.new(product_params)

      respond_to do |format|
        if @product.save
---
INSERT INTO "products" ("name", "on_hand", "description", "permalink", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Moose Tracks Elm"], ["on_hand", 12], ["description", ""], ["permalink", "moose-tracks-elm"], ["created_at", "2016-06-01 15:24:23.136174"], ["updated_at", "2016-06-01 15:24:23.136174"]]

    def update
      respond_to do |format|
        if @product.update(product_params)
---
UPDATE "products" SET "on_hand" = ?, "available" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["on_hand", 4], ["available", 2], ["updated_at", "2016-06-01 15:38:19.421413"], ["id", 13]]