app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."permalink" = ? LIMIT 1  [["permalink", "waffle-cone-pine"]]
---
    def set_product
      @product = Product.find_by_permalink(params[:id])